sergev/LiteBSD/sys/mips/pic32/trap.c
/*
 * Return the resulting PC as if the branch was executed.
 */
unsigned
MachEmulateBranch(regsPtr, instPC, fpcCSR, allowNonBranch)
    unsigned *regsPtr;
    unsigned instPC;
    unsigned fpcCSR;
    int allowNonBranch;
{
    InstFmt inst;
    unsigned retAddr;
    int condition;
    extern unsigned GetBranchDest();


    inst = *(InstFmt *)instPC;
#if 0
    printf("regsPtr=%x PC=%x Inst=%x fpcCsr=%x\n", regsPtr, instPC,
        inst.word, fpcCSR); /* XXX */
#endif
    switch ((int)inst.JType.op) {
    case OP_SPECIAL:
        switch ((int)inst.RType.func) {
        case OP_JR:
        case OP_JALR:
            retAddr = regsPtr[inst.RType.rs];
            break;

        default:
            if (!allowNonBranch)
                panic("MachEmulateBranch: Non-branch");
            retAddr = instPC + 4;
            break;
        }
        break;

    case OP_BCOND:
        switch ((int)inst.IType.rt) {
        case OP_BLTZ:
        case OP_BLTZAL:
            if ((int)(regsPtr[inst.RType.rs]) < 0)
                retAddr = GetBranchDest((InstFmt *)instPC);
            else
                retAddr = instPC + 8;
            break;

        case OP_BGEZAL:
        case OP_BGEZ:
            if ((int)(regsPtr[inst.RType.rs]) >= 0)
                retAddr = GetBranchDest((InstFmt *)instPC);
            else
                retAddr = instPC + 8;
            break;

        default:
            panic("MachEmulateBranch: Bad branch cond");
        }
        break;

    case OP_J:
    case OP_JAL:
        retAddr = (inst.JType.target << 2) |
            ((unsigned)instPC & 0xF0000000);
        break;

    case OP_BEQ:
        if (regsPtr[inst.RType.rs] == regsPtr[inst.RType.rt])
            retAddr = GetBranchDest((InstFmt *)instPC);
        else
            retAddr = instPC + 8;
        break;

    case OP_BNE:
        if (regsPtr[inst.RType.rs] != regsPtr[inst.RType.rt])
            retAddr = GetBranchDest((InstFmt *)instPC);
        else
            retAddr = instPC + 8;
        break;

    case OP_BLEZ:
        if ((int)(regsPtr[inst.RType.rs]) <= 0)
            retAddr = GetBranchDest((InstFmt *)instPC);
        else
            retAddr = instPC + 8;
        break;

    case OP_BGTZ:
        if ((int)(regsPtr[inst.RType.rs]) > 0)
            retAddr = GetBranchDest((InstFmt *)instPC);
        else
            retAddr = instPC + 8;
        break;

    case OP_COP1:
        switch (inst.RType.rs) {
        case OP_BCx:
        case OP_BCy:
            if ((inst.RType.rt & COPz_BC_TF_MASK) == COPz_BC_TRUE)
                condition = fpcCSR & MACH_FPC_COND_BIT;
            else
                condition = !(fpcCSR & MACH_FPC_COND_BIT);
            if (condition)
                retAddr = GetBranchDest((InstFmt *)instPC);
            else
                retAddr = instPC + 8;
            break;

        default:
            if (!allowNonBranch)
                panic("MachEmulateBranch: Bad coproc branch instruction");
            retAddr = instPC + 4;
        }
        break;

    default:
        if (!allowNonBranch)
            panic("MachEmulateBranch: Non-branch instruction");
        retAddr = instPC + 4;
    }
#if 0
    printf("Target addr=%x\n", retAddr); /* XXX */
#endif
    return (retAddr);
}

unsigned
GetBranchDest(InstPtr)
    InstFmt *InstPtr;
{
    return ((unsigned)InstPtr + 4 + ((short)InstPtr->IType.imm << 2));
}

/*
 * This routine is called by procxmt() to single step one instruction.
 * We do this by storing a break instruction after the current instruction,
 * resuming execution, and then restoring the old instruction.
 */
cpu_singlestep(p)
    register struct proc *p;
{
    register unsigned va;
    register int *locr0 = p->p_md.md_regs;
    int i;

    /* compute next address after current location */
    va = MachEmulateBranch(locr0, locr0[PC], locr0[FSR], 1);
    if (p->p_md.md_ss_addr || p->p_md.md_ss_addr == va ||
        !useracc((caddr_t)va, 4, B_READ)) {
        printf("SS %s (%d): breakpoint already set at %x (va %x)\n",
            p->p_comm, p->p_pid, p->p_md.md_ss_addr, va); /* XXX */
        return (EFAULT);
    }
    p->p_md.md_ss_addr = va;
    p->p_md.md_ss_instr = fuiword((caddr_t)va);
    i = suiword((caddr_t)va, MACH_BREAK_SSTEP);
    if (i < 0) {
        vm_offset_t sa, ea;
        int rv;

        sa = trunc_page((vm_offset_t)va);
        ea = round_page((vm_offset_t)va+sizeof(int)-1);
        rv = vm_map_protect(&p->p_vmspace->vm_map, sa, ea,
            VM_PROT_DEFAULT, FALSE);
        if (rv == KERN_SUCCESS) {
            i = suiword((caddr_t)va, MACH_BREAK_SSTEP);
            (void) vm_map_protect(&p->p_vmspace->vm_map,
                sa, ea, VM_PROT_READ|VM_PROT_EXECUTE, FALSE);
        }
    }
    if (i < 0)
        return (EFAULT);
#if 0
    printf("SS %s (%d): breakpoint set at %x: %x (pc %x) br %x\n",
        p->p_comm, p->p_pid, p->p_md.md_ss_addr,
        p->p_md.md_ss_instr, locr0[PC], fuword((caddr_t)va)); /* XXX */
#endif
    return (0);
}
